▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

🌹සිහිනයකි┉┉||
🌹නුඹ හැමදාමත්┉┉||
🌹හිත සැරසූ┉┉||
🌹තුරුලේ දැවටී මා සැනසූ┉┉||
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

🉐Don't Think About it......🤭🤭 
🉐It Is Song In My Language 🇱🇰 
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

☣️Add This Smali
┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉

.method public static Payment_method(I)I
    .registers 3

    const-string v1, "Payment_method"

    invoke-static {v1}, Lcom/sammods/Privacy;->getPrivacyB(Ljava/lang/String;)Z

    move-result v0

    if-eqz v0, :cond_b

    const/high16 v0, 0x0

    return v0

    :cond_b
    const/high16 v0, 0x10000

    return v0
.end method

▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

☣️ "MessageUtil/isValidV2E2eMessage/error unknown-message-count, exception=" 

┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉

search»»»»const/high16 v1, 0x10000 (line 270~280)

┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉

invoke-static {v1}, Lcom/sammods/Privacy;->Payment_method(I)I

    move-result v1
    
┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉

search»»» const/high16 v1, 0x200000

484 line number

┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉

▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

☣️ yo_convo_mods.xml or you like xml🤭

      <CheckBoxPreference
            android:title="Payment method Immune"
            android:key="Payment_method"
            android:widgetLayout="@layout/MRMODS_Button_Style"
            android:summaryOn="✅ Activated ✅"
            android:summaryOff="click to immune payment virus"
            android:defaultValue="false" />
            
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

🌹පුදුමයකි මට කවදාවත්┉┉||
🌹නොරිදවපු┉┉||
🌹නුඹගේ හිත┉┉||
🌹ඇයි දැන් අමුතු┉┉||

▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

            